# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [37]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [38]:
# your answer here
df = pd.read_csv("./data/Employee.csv")
df

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [39]:
# Method 1: groupby. no need to define mean function
display(df.groupby(['Department']).agg({'Salary':"mean"}))

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [44]:
# Method 2: pivot
df["Years"] = df["Years"].astype(str)
display(df.pivot_table(index='Department'))

# ,columns='Salary'

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

if you have duplicate entries in the index column, use .pivot_table

if you have all unique entries in the index column, use .pivot

In [20]:
df_pivot = df.pivot_table(index = "Department", columns = "Salary")
df_pivot

C:\Users\mdima\AppData\Local\Temp\ipykernel_18152\1729027517.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  df_pivot = df.pivot_table(index = "Department", columns = "Salary")

           Years
Salary        30   35    55   60   70
Department
HR           2.0  4.0   NaN  NaN  8.0
IT           2.0  1.0   NaN  7.0  8.0
Sales        NaN  NaN  16.0  NaN  NaN

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [45]:
# your answer here
display(df.pivot_table(index=['Department','Title'], aggfunc ="mean"))

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [53]:
display(df.pivot_table(values = ["Years", "Salary"], index=['Title'], aggfunc = {"Years":"count", "Salary":"mean"}))
# pd.pivot_table(df, values='col1', index='col2', columns='col3',aggfunc='count')

              Salary  Years
Title
VP         70.000000      2
analyst    32.500000      4
associate  56.666667      3

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [47]:
df.head(0)

Empty DataFrame
Columns: [Name, Department, Education, Gender, Title, Years, Salary]
Index: []

In [48]:
# df["Years"] = df["Years"].astype(str)
# display(df.pivot_table(index=['Department','Title']))
display(df.pivot_table(values = ["Salary", "Name"], index=["Department",'Title'], aggfunc = {"Salary":"mean", "Name":"count"}))
# see lab on thursday!

                      Name  Salary
Department Title
HR         VP            1    70.0
           analyst       2    32.5
IT         VP            1    70.0
           analyst       2    32.5
           associate     1    60.0
Sales      associate     2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [58]:
# your answer here
df_medminmaxstd = df.pivot_table(values = ["Salary"], index=["Department",'Title'], aggfunc = ["median", "min", "max", "std"])

In [ ]:
# there are some NaN in std deviation column. it is because  the min/max value is the same as
# the median value, so the difference is 0 (probably?)
# but in sales row, we can see the 0.000 in std column, and not NaN

#### Based on your comments, fill the missing values with an appropriate value.

In [59]:
# your answer here
df_medminmaxstd.columns
df_medminmaxstd[("std", "Salary")] = df_medminmaxstd[("std", "Salary")].fillna(0)
df_medminmaxstd

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [60]:
# your answer here
df_medminmaxstd = df.pivot_table(values = ["Name","Salary"], index=["Department"], aggfunc = {"Name":"count", "Salary":"sum"})
df_medminmaxstd

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [61]:
# your answer here
df_yearssalary = df.pivot_table(values = ["Years", "Salary"], index=["Department",'Title'], aggfunc = {"Years":"sum", "Salary":"mean"})
df_yearssalary = df_yearssalary(columns = {"Years":"Years of Experience", "Salary":"Mean Salary"})
df_yearssalary

                      Salary Years
Department Title
HR         VP           70.0     8
           analyst      32.5    24
IT         VP           70.0     8
           analyst      32.5    12
           associate    60.0     7
Sales      associate    55.0    32

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
def remove_max():

In [ ]:
# your answer here
def mean_no_max(x):
    no_max = []
    for i in x:
        if i == x.max():
            no_max
        else:
            no_max.append(i)
    mean = np.mean(no_max)
    return mean

df_mean_no_max = employee.pivot_table(index = ["Department"], values = ["Salary"], aggfunc = ["mean", mean_no_max])
df_mean_no_max